/*Что нужно сделать

Используя макросы вместе с условными директивами прекомпиляции (#if / #endif),
 реализуйте простую программу по выводу названия времени года в консоль.

Пользователь программы в данном случае сам программист.
 С помощью определения одного из макросов: SPRING, SUMMER, AUTUMN или WINTER, он задаёт сезон, название которого хочет увидеть на экране.
 При компиляции и запуске программы на экране должно появиться название именно этого сезона и только его.

Советы и рекомендации
Так как препроцессор работает вообще до компиляции, то в #if / #endif директивы вы можете обернуть всю функцию main сразу.
Обязательно просмотрите итоговый код после препроцессинга из CLion с помощью “Shift-Shift -> Preprocess current TU”.*/

#include <iostream>

#define SPRING
#define PRINT(a) std::cout << a << std::endl;




int main() {
#ifdef SPRING
    PRINT("Spring")
#endif

#ifdef SUMMER
    PRINT("Summer")
#endif

#ifdef AUTUMN
    PRINT("Autumn")
#endif

#ifdef WINTER
    PRINT("Winter")
#endif

    return 0;
}
